app/controllers/school_classes_controller.rb

	def update
	  @school_class = SchoolClass.find(params[:id])
	  @school_class.update(params.require(:school_class))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 99], ["updated_at", "2020-06-10 11:41:31.401168"], ["id", 1]]